In [5]:
import pandas as pd
import mysql.connector
import sqlalchemy
from sqlalchemy import create_engine

In [6]:
cnx = mysql.connector.connect(user='root', password='password', 
                              host='127.0.0.1', database='otus_db', port='3306')
cur = cnx.cursor()

In [7]:
engine = create_engine('mysql+pymysql://root:password@127.0.0.1/otus_db')

In [8]:
df = pd.read_csv('some_customers.csv')
df.head()

,title,first_name,last_name,correspondence_language,birth_date,gender,marital_status,country,postal_code,region,city,street,building_number
0,Dr.,Danilo,Ambrosini,IT,1900-01-01,Unknown,NaN,IT,21100,NaN,Varese,Via dolomiti,13
1,Mrs,Deborah,Thomas,NaN,NaN,Female,NaN,GB,RH16 3TQ,NaN,Haywards heath,Cobbetts mead,31
2,Herr,Markus,Hönninge,DE,1900-01-01,Male,NaN,DE,69493,NaN,Hirschberg an der bergstraße,Breitgasse 5a,NaN
3,Mrs,Sheila,Spiller,EN,NaN,Unknown,NaN,GB,TN6 1ST,East sussex,Crowborough,Ghyll road,NaN
4,Mrs,Rosemary,Bailey,EN,NaN,Unknown,NaN,GB,NR34 7SH,NaN,Beccles,Pepys avenue,24

### Справочник стран

In [9]:
df_country = df[['country']].drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "country_id"}).astype({'country': 'string'})
df_country.head()

   country_id country
0           0      IT
1           1      GB
2           2      DE
3           3      PL
4           4      BE

In [4]:
df_country.dtypes

country_id     int64
country       string
dtype: object

In [14]:
cur.execute('''
            drop TABLE if exists dim_country;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_country (
                country_id INT UNSIGNED NOT null PRIMARY KEY,
                country VARCHAR(25) NOT null);
''')

df_country.to_sql('dim_country', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_country;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   country_id country
0           0      IT
1           1      GB
2           2      DE
3           3      PL
4           4      BE

### Справочник регионов

In [24]:
df_region = df[['region']].drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "region_id"}).astype({'region': 'string'}).fillna('NULL')
df_region.head()

   region_id       region
0          0         NULL
1          1  East sussex
2          2       Ancona
3          3     Cornwall
4          4       Surrey

In [25]:
df_region.dtypes

region_id     int64
region       string
dtype: object

In [26]:
cur.execute('''
            drop TABLE if exists dim_region;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_region (
                region_id INT UNSIGNED NOT null PRIMARY KEY,
                region VARCHAR(25) NOT null);
''')

df_region.to_sql('dim_region', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_region;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   region_id       region
0          0         NULL
1          1  East sussex
2          2       Ancona
3          3     Cornwall
4          4       Surrey

### Справочник городов

In [30]:
df_city = df[['city']].drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "city_id"}).astype({'city': 'string'}).fillna('NULL')
df_city.head()

   city_id                          city
0        0                        Varese
1        1                Haywards heath
2        2  Hirschberg an der bergstraße
3        3                   Crowborough
4        4                       Beccles

In [31]:
cur.execute('''
            drop TABLE if exists dim_city;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_city (
                city_id INT UNSIGNED NOT null PRIMARY KEY,
                city VARCHAR(255) NOT null);
''')

df_city.to_sql('dim_city', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_city;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   city_id                          city
0        0                        Varese
1        1                Haywards heath
2        2  Hirschberg an der bergstraße
3        3                   Crowborough
4        4                       Beccles

### Справочник адресов

In [32]:
df_address = df[['postal_code', 'street', 'building_number']] \
.drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "address_id"}) \
.astype({'postal_code': 'string', 'street': 'string', 'building_number': 'string'}) \
.fillna('NULL')
df_address.head()

   address_id postal_code         street building_number
0           0       21100   Via dolomiti              13
1           1    RH16 3TQ  Cobbetts mead              31
2           2       69493  Breitgasse 5a            NULL
3           3     TN6 1ST     Ghyll road            NULL
4           4    NR34 7SH   Pepys avenue              24

In [88]:
cur.execute('''
            drop TABLE if exists dim_address;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_address (
                address_id INT UNSIGNED NOT null PRIMARY KEY,
                postal_code VARCHAR(255) NOT null,
                street VARCHAR(255) NOT null,
                building_number VARCHAR(255) NOT null
                )
                ;
''')

df_address.to_sql('dim_address', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_address;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

   address_id postal_code         street building_number
0           0       21100   Via dolomiti              13
1           1    RH16 3TQ  Cobbetts mead              31
2           2       69493  Breitgasse 5a            NULL
3           3     TN6 1ST     Ghyll road            NULL
4           4    NR34 7SH   Pepys avenue              24

### Справочник клиентов

In [52]:
df_clients = df[['first_name', 'last_name', 'birth_date']] \
.drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "client_id"}) \
.astype({'first_name': 'string', 'last_name': 'string', 'birth_date': 'string'}) \
.fillna('NULL')
df_clients['birth_date'] = df_clients['birth_date'].replace('NULL', '1900-01-01')
df_clients['birth_date'] = pd.to_datetime(df_clients['birth_date'], format='%Y-%m-%d', errors='coerce')  
df_clients['birth_date'] = df_clients['birth_date'].fillna('1900-01-01')
df_clients.head()

   client_id first_name  last_name birth_date
0          0     Danilo  Ambrosini 1900-01-01
1          1    Deborah     Thomas 1900-01-01
2          2     Markus   Hönninge 1900-01-01
3          3     Sheila    Spiller 1900-01-01
4          4   Rosemary     Bailey 1900-01-01

In [53]:
cur.execute('''
            drop TABLE if exists dim_clients;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_clients (
                client_id INT UNSIGNED NOT null PRIMARY KEY,
                first_name VARCHAR(255) NOT null,
                last_name VARCHAR(255) NOT null,
                birth_date DATE NOT null
                )
                ;
''')

df_clients.to_sql('dim_clients', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_clients;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   client_id first_name  last_name  birth_date
0          0     Danilo  Ambrosini  1900-01-01
1          1    Deborah     Thomas  1900-01-01
2          2     Markus   Hönninge  1900-01-01
3          3     Sheila    Spiller  1900-01-01
4          4   Rosemary     Bailey  1900-01-01

### Справочник языков

In [54]:
df_language = df[['correspondence_language']].drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "language_id"}).astype({'correspondence_language': 'string'}).fillna('NULL')
df_language.head()

   language_id correspondence_language
0            0                      IT
1            1                    NULL
2            2                      DE
3            3                      EN
4            4                      PL

In [55]:
cur.execute('''
            drop TABLE if exists dim_language;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_language (
                language_id INT UNSIGNED NOT null PRIMARY KEY,
                correspondence_language VARCHAR(255) NOT null);
''')

df_language.to_sql('dim_language', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_language;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   language_id correspondence_language
0            0                      IT
1            1                    NULL
2            2                      DE
3            3                      EN
4            4                      PL

### Справочник полов

In [57]:
df_gender = df[['gender']].drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "gender_id"}).astype({'gender': 'string'}).fillna('NULL')
df_gender.head()

   gender_id   gender
0          0  Unknown
1          1   Female
2          2     Male
3          3     NULL

In [58]:
cur.execute('''
            drop TABLE if exists dim_gender;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_gender (
                gender_id INT UNSIGNED NOT null PRIMARY KEY,
                gender VARCHAR(25) NOT null);
''')

df_gender.to_sql('dim_gender', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_gender;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   gender_id   gender
0          0  Unknown
1          1   Female
2          2     Male
3          3     NULL

### Справочник титулов

In [59]:
df_title = df[['title']].drop_duplicates().reset_index(drop=True).reset_index() \
.rename(columns={"index": "title_id"}).astype({'title': 'string'}).fillna('NULL')
df_title.head()

   title_id title
0         0   Dr.
1         1   Mrs
2         2  Herr
3         3    Mr
4         4  NULL

In [60]:
cur.execute('''
            drop TABLE if exists dim_title;
            ''')


cur.execute(f'''
CREATE TABLE 
            dim_title (
                title_id INT UNSIGNED NOT null PRIMARY KEY,
                title VARCHAR(25) NOT null);
''')

df_title.to_sql('dim_title', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from dim_title;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   title_id title
0         0   Dr.
1         1   Mrs
2         2  Herr
3         3    Mr
4         4  NULL

In [61]:
df.head()

,title,first_name,last_name,correspondence_language,birth_date,gender,marital_status,country,postal_code,region,city,street,building_number
0,Dr.,Danilo,Ambrosini,IT,1900-01-01,Unknown,NaN,IT,21100,NaN,Varese,Via dolomiti,13
1,Mrs,Deborah,Thomas,NaN,NaN,Female,NaN,GB,RH16 3TQ,NaN,Haywards heath,Cobbetts mead,31
2,Herr,Markus,Hönninge,DE,1900-01-01,Male,NaN,DE,69493,NaN,Hirschberg an der bergstraße,Breitgasse 5a,NaN
3,Mrs,Sheila,Spiller,EN,NaN,Unknown,NaN,GB,TN6 1ST,East sussex,Crowborough,Ghyll road,NaN
4,Mrs,Rosemary,Bailey,EN,NaN,Unknown,NaN,GB,NR34 7SH,NaN,Beccles,Pepys avenue,24

In [69]:
df = df.fillna('NULL')
df['birth_date'] = df['birth_date'].replace('NULL', '1900-01-01')
df['birth_date'] = pd.to_datetime(df_clients['birth_date'], format='%Y-%m-%d', errors='coerce')  
df['birth_date'] = df['birth_date'].fillna('1900-01-01')
df = df.astype({'title': 'string', 'first_name': 'string', 'last_name': 'string',
          'correspondence_language': 'string', 'gender': 'string', 'marital_status': 'string',
          'country': 'string', 'postal_code': 'string','region': 'string',
          'city': 'string', 'street': 'string',
          'building_number': 'string'})

In [72]:
df.dtypes

title                              string
first_name                         string
last_name                          string
correspondence_language            string
birth_date                 datetime64[ns]
gender                             string
marital_status                     string
country                            string
postal_code                        string
region                             string
city                               string
street                             string
building_number                    string
dtype: object

In [75]:
new_df = df.merge(df_clients, on = ['first_name', 'last_name', 'birth_date']) \
.merge(df_language, on = ['correspondence_language']) \
.merge(df_gender, on = ['gender']) \
.merge(df_title, on = ['title']) \
.merge(df_address, on = ['postal_code', 'street', 'building_number']) \
.merge(df_city, on = ['city']) \
.merge(df_region, on = ['region']) \
.merge(df_country, on = ['country']) 

new_df.head()

,title,first_name,last_name,correspondence_language,birth_date,gender,marital_status,country,postal_code,region,...,street,building_number,client_id,language_id,gender_id,title_id,address_id,city_id,region_id,country_id
0,Dr.,Danilo,Ambrosini,IT,1900-01-01,Unknown,NULL,IT,21100,NULL,...,Via dolomiti,13,0,0,0,0,0,0,0,0
1,Dr.,Enzo,Lusini,IT,1900-01-01,Unknown,NULL,IT,50141,NULL,...,Via aligi barducci,44,74,0,0,0,75,72,0,0
2,Dr.,Pietro,Ciprietti,IT,1900-01-01,Unknown,NULL,IT,64018,NULL,...,Via panoramica,23,251,0,0,0,252,216,0,0
3,Dr.,Gabriele,Gardin,IT,1900-01-01,Unknown,NULL,IT,25040,NULL,...,Via cesare battisti,7,291,0,0,0,293,253,0,0
4,Dr.,Marco,Tognoni,IT,1900-01-01,Unknown,NULL,IT,54033,NULL,...,Via antonio bertoloni,29,389,0,0,0,393,335,0,0

### Витрина с прочей информацией по клиентам

In [80]:
clients_other_info = new_df[['client_id', 'title_id', 'gender_id', 'language_id']] \
.drop_duplicates()
clients_other_info.head()

   client_id  title_id  gender_id  language_id
0          0         0          0            0
1         74         0          0            0
2        251         0          0            0
3        291         0          0            0
4        389         0          0            0

In [83]:
cur.execute('''
            drop TABLE if exists clients_other_info;
            ''')


cur.execute(f'''
CREATE TABLE 
            clients_other_info (
                client_id INT NOT null,
                 title_id INT NOT null,
                  gender_id INT NOT null,
                   language_id INT NOT null);
''')

clients_other_info.to_sql('clients_other_info', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from clients_other_info;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   client_id  title_id  gender_id  language_id
0          0         0          0            0
1         74         0          0            0
2        251         0          0            0
3        291         0          0            0
4        389         0          0            0

### Витрина с адресной информацией по клиентам

In [90]:
clients_address_info = new_df[['client_id', 'country_id', 'region_id', 'address_id', 'city_id']] \
.drop_duplicates()
clients_address_info.head()

   client_id  country_id  region_id  address_id  city_id
0          0           0          0           0        0
1         74           0          0          75       72
2        251           0          0         252      216
3        291           0          0         293      253
4        389           0          0         393      335

In [91]:
cur.execute('''
            drop TABLE if exists clients_address_info;
            ''')


cur.execute(f'''
CREATE TABLE 
            clients_address_info (
                client_id INT NOT null,
                 country_id INT NOT null,
                  region_id INT NOT null,
                   address_id INT NOT null,
                   city_id INT NOT null);
''')

clients_address_info.to_sql('clients_address_info', con = engine,  if_exists='append', index=False)
 
query = f'''
select * from clients_address_info;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   client_id  country_id  region_id  address_id  city_id
0          0           0          0           0        0
1         74           0          0          75       72
2        251           0          0         252      216
3        291           0          0         293      253
4        389           0          0         393      335

### Проверка JOIN

In [92]:
query = f'''
select *
from clients_address_info l
left join dim_address r
on l.address_id = r.address_id;
        '''
df_sql = pd.read_sql_query(query, cnx)
df_sql.head()

/Users/denis/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,client_id,country_id,region_id,address_id,city_id,address_id,postal_code,street,building_number
0,0,0,0,0,0,0,21100,Via dolomiti,13
1,74,0,0,75,72,75,50141,Via aligi barducci,44
2,251,0,0,252,216,252,64018,Via panoramica,23
3,291,0,0,293,253,293,25040,Via cesare battisti,7
4,389,0,0,393,335,393,54033,Via antonio bertoloni,29